Following commands are executed within directory =02-formal-modeling=

* Generate Formal Model for setup =setup_companyRegistered=

Running

#+name: gen1
#+BEGIN_SRC sh :results output :exports both :eval no-export
(SETUP=setup_companyRegistered;  bundle exec  sbuilder.rb generate $SETUP)
#+END_SRC

outputs sbuilder translation log 

#+RESULTS: gen1
#+begin_example
generate setup: setup_companyRegistered
Unmustache  src/ --> cache/unmustache - start
Unmustache  src/ --> cache/unmustache - done
Parse snippet from repository cache/unmustache - start
 Initialize parserResolver context symbols
   4 TLA+ symbols
   6 SBuilder symbols
   3 model symbols
 Initialize parserResolver context symbols - done

Parse snippet from repository cache/unmustache - done: parsed 0 snippets
#+end_example


and creates TLA-files for setup =setup_companyRegistered= into the
directory =gen/$SETUP/tla=:

#+BEGIN_SRC sh :eval no-export :results output :exports results
SETUP=setup_companyRegistered; ls -1 gen/$SETUP/tla/*.tla
#+END_SRC

#+RESULTS:
: gen/setup_companyRegistered/tla/config.tla
: gen/setup_companyRegistered/tla/model.tla
: gen/setup_companyRegistered/tla/possible_isCompanyRegisteredFails.tla
: gen/setup_companyRegistered/tla/possible_isCompanyRegistered.tla
: gen/setup_companyRegistered/tla/setup.tla


